RoodsBurger/brushless_lamp/s3/archive/diagnostic/test_ble/sdkconfig.defaults.esp32s3
CONFIG_IDF_TARGET="esp32s3"

## Match m4-matter's CPU clock so any clock-related behaviour reproduces.
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240
CONFIG_ESP32S3_DEFAULT_CPU_FREQ_240=y
CONFIG_ESP32S3_DEFAULT_CPU_FREQ_MHZ=240

## USB-Serial-JTAG console — same as m4-matter so the USB-host-enumeration
## behaviour we're testing reproduces identically.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
# CONFIG_SPIRAM is not set

## Quiet logs by default (USB-CDC backpressure mitigation, same as m4-matter).
CONFIG_LOG_DEFAULT_LEVEL_WARN=y
# CONFIG_LOG_DEFAULT_LEVEL_INFO is not set
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y

## Bluetooth: NimBLE host, no Bluedroid.
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=n
CONFIG_BT_CONTROLLER_ENABLED=y

## Pinned to core 0 to match m4-matter behaviour.
CONFIG_BT_CTRL_PINNED_TO_CORE_0=y
CONFIG_BT_NIMBLE_PINNED_TO_CORE_0=y

## WiFi enabled — match m4-matter's profile so coex pressure reproduces.
CONFIG_ESP_WIFI_ENABLED=y
